//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.


// for (let i = 0; i < 10; i++) {
//     console.log("<div>Hello World</div>");
//     document.write("<div>Hello World</div>")
// }
// for (let i = 0; i < 10; i++) {
//     console.log("<div>Hello "+i+" World</div>");
//     document.write("<div>Hello World</div>")
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof
//     вивести тільки булеві елементи

//     let arr1 = [1, true, true, false, null, true, 23, 15, 123, false, true, 'hello', 'mouse'];
// for (let i = 0; i < arr1.length; i++) {
//
//     if (typeof arr1[i] === 'boolean') {
//         console.log(arr1[i]);
//
//     } else {
//         console.log('error');
//     };
//
// }
// let array = [1, true, true, false, null, true, 23, 15, 123,4143141, false, true, 'hello'];
// for (let i = 0; i < array.length; i++) {
//     if (typeof array[i] === 'number') {
//         console.log(array[i]);
//     }

// const arr = [];
// arr[0] = 'string';
// arr[2] = 124;
// arr[15] = null;
// arr[45] = undefined;
// arr[32] = BigInt(12414141411141);
// console.log(arr);


// - Створити цикл for на 10  ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++) {
//
//     console.log(`${i} ${'днiв без мозку'}`);
// }

// - Створити цикл for на 100 ітерацій з кроком 1.
// Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++) {
//
//     console.log(`${i} ${'днiв без мозку'}`);
// }

// - Створити цикл for на 100 ітерацій з кроком 2.
// Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i+=2) {
//
//     console.log(`${i} ${'днiв без мозку'}`);
// }

// - Створити цикл for на 100 ітерацій.
// Вивести тільки парні кроки. через console.log + document.write

// for (let i = 0; i < 10; i++) {
//
//     console.log(`${"<div> Lorem ipsum dolor sit amet, consectetur adipisicing  elit. Incidunt, tempore. </div>"}`);
// }

// - Створити цикл for на 100 ітерацій.
// Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 0; i < 100; i++) {
//     if (i%2) or (!(i%2)) {
//         console.log(i);
//     }
//
// }


// - Відтворити роботу годинника, відрахувавши 2 хвилини
// (2 цикли! 1й - хвилини, 2й - секунди)

// let time = 2;

// for (let min = 0; min < 3; min++) {
//
//     for (let sec = 0; sec < 60; sec++) {
//
//         console.log(min + ' min ' + sec + ' sec');
//         if (min === time) {
//             break;
//         }
//     }
//
// }


// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини
// (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//

let time = 2;

for (let sec = 0; sec < 60; sec++) {
    console.log(sec + ' min');
    for (let min = 0; min < 60; min++) {
        console.log(min + ' min ' + sec + ' sec');
    for (let hours = 0; hours <= 2; hours++) {
        console.log(hours + ' hours ' + min + ' min ' + sec + ' sec');
    }
    }

}


// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3
// за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
//     За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив.
//     За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1
// створити пустий масив та :
//     1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.