// - создать массив с 20 числами.
// -- при помощи метода sort и колбека  отсортировать массив.
// -- при помощи метода sort и колбека отсортировать массив в ниспадающем напралении.
// -- при помощи filter получить числа кратные 3
// -- при помощи filter получить числа кратные 10
// -- перебрать (проитерировать) массив при помощи foreach()
// -- перебрать массив при помощи map() и получить новый массив в котором все значения будут в 3 раза больше


let arrNum = [12, 4535, 123, 21, 45, 6, 256, 76, 88, 32, 65, 1234, 75, 234, 235, 7, 878, 326, 33, 2];

function sortNumb() {

    const sort = arrNum.sort((a, b) => {

        }
    )
}