// --створити масив та вивести його в консоль:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
// Вивести в консоль

//
//
// const myArrayNum = [1, 2, 4, 213, 522];
// const myArrayStr = ['Hello', 'My', 'Native', 'Yong', 'World'];
// const saltArr = ['bee', true, 24, 'strawberry', false, 431, 'Sherman', true, 26,'Anakonda', false,
//     1561, 'smell', true, 112515];
// const emptyArr = [];
// emptyArr[2]=14;
// emptyArr[15]=11241;
// emptyArr[5]='Uncle of Jacky';
// emptyArr[33]='Recognition of text';
// emptyArr[21]=true;
//
// console.log(emptyArr, myArrayNum,myArrayStr,saltArr);


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// - За допомогою циклу for і document.write() вивести 10 блоків div
// з довільним текстом і індексом всередині

// for (let i=0; i<10; i++ ) {
//     document.write('<div style="color: red">Hello world it`s me Hello</div>');
//
// };

// 0
// Hello world it`s me Hello
// 1
// Hello world it`s me Hello
// 2
// Hello world it`s me Hello

// for (let i=0; i<10; i++ ) {
//     document.write(i + '<div style="color: red">Hello world it`s me Hello</div>')
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let i =0;
// while (i<20) {
//     i++; document.write(i+ '<h1>${some fish text}</h1>');
//     console.log('i.length');
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let arrNum = [12,235,124,1645,124,1562,15151,63,3,676];
// let arrWrd = ['Strong','smile','mouse','nba','balalaika','vodka','array','smell','orange+10','Bibo'];
//
// console.log(arrNum,arrWrd);


// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//
// let array1 = [1414,'hello', false, 'fish', null, 'obj', true, 'story', 115151, false, 'woman'];
// for (let i = 0; i<array1.length; i++) {
//      console.log(array1[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та
// typeof вивести тільки булеві елементи

// let array1 = [1414, 'hello', false, 'fish', null, 'obj', true, 'story', 115151, false, 'woman', 1414, 'hello', false,
//     'fish', null, 'obj', true, 'story', 115151, false, 'woman', false];
// for (let i = 0; i < array1.length; i++) {
//     if (typeof array1[i] === "boolean") {
//
//         console.log(array1[i]);
//     }
// }


// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та
// typeof вивести тільки числові елементи
//
// let array1 = [1414, 'hello', false, 'fish', null, 'obj', true, 'story', 115151, false, 'woman', 1414, 'hello', false,
//     'fish', null, 'obj', true, 'story', 115151, false, 'woman', false];
//
// for (let i = 0; i < array1.length; i++) {
//     if (typeof(array1[i]) === 'number') {
//         console.log(array1[i]);
//     }
//
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та
// typeof вивести тільки рядкові елементи

// let array1 = [1414, 'hello', false, 'fish', null, 'obj', true, 'story', 115151, false, 'woman', 1414, 'hello', false,
//     'fish', null, 'obj', true, 'story', 115151, false, 'woman', false];
// for (let i = 0; i < array1.length; i++) {
//     const array1Element = array1[i];
//     if (typeof array1Element === 'string') {
//         console.log(array1Element);
//     }
// }


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення
// до конкретних індексів. Вивести в консоль всі його елементи в циклі.

let arr = [1,2,3];
console.log(arr);




// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log
// та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log
// та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log
// та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
//
// =================
// =================
// =================
// =================
//
// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1
// створити пустий масив та :
//     1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
// 2. вывести на консоль  каждый третий елемент
// 3. вывести на консоль  каждый третий елемент
// но при условии что его значение является парным.
// 4. вывести на консоль  каждый третий елемент
// но при условии что он имеет парное значение и
// записать их в другой массив.
// 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
//
// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.
//
